; domain
(define (domain SingleRobotRunner)
(:requirements
    :typing
    :negative-preconditions
)

(:types
    robot gridsquare direction
)

(:predicates
    ;Planning Robot location
    (agent-at ?loc - gridsquare)
    
    ;Agent Robot is rotated a particular way
    (agent-rotated ?d - direction)
    
    ;Other immovable robots occupy squares
    (robot-at ?loc - gridsquare)
    
    ;Obstacle on a particular gridsquare
    (obstacle-at ?loc - gridsquare)
    
    ;Grid square adjacent in particular direction
    (gridsquare-connected ?from ?to - gridsquare ?d - direction)
    
    ;Rotation adjacency
    (rotation-adjacent ?from ?to - direction)
)

;The Agent Robot can move if
;  - The Agent Robot is at the current location,
;  - The Agent Robot is rotated towards the square,
;  - There is no Robot at the destination,
;  - The Agent Robot is not already at the destination location.
;Effects: Move the Agent Robot to the destination.
(:action moveforward
    :parameters (?from - gridsquare ?to - gridsquare ?d - direction)
    :precondition (and 
        (agent-at ?from)
        (agent-rotated ?d)
        (gridsquare-connected ?from ?to ?d)
        (not (robot-at ?to))
        (not (obstacle-at ?to)) 
    )
    :effect (and 
        (not (agent-at ?from))
        (agent-at ?to)
    )
)

;The Agent Robot can rotate the direction it is currently facing from its old 
; direction to a new direction if
;  - The Agent Robot is at the Current Rotation,
;  - The Destination Rotation is an adjacent rotation to the Current Rotation,
;Effects: Switch the rotation of the agent to the new rotation
(:action rotate
    :parameters (?fromdir - direction ?todir - direction)
    :precondition (and 
        (agent-rotated ?fromdir)
        (rotation-adjacent ?fromdir ?todir)
    )
    :effect (and 
        (not (agent-rotated ?fromdir))
        (agent-rotated ?todir)
    )
)

)

; problem
(define (problem p1-network)
  (:domain SingleRobotRunner)

  (:objects
    g00 g01 g02 g03
    g10 g11 g12 g13
    g20 g21 g22 g23
    g30 g31 g32 g33 - gridsquare

    north east south west - direction
  )

  (:init
    ; Agent start position
    (agent-at g00)

    ; Agent initial direction
    (agent-rotated east)

    ; Other robots positions
    (robot-at g10)
    (robot-at g12)
    
    ; Obstacles
    (obstacle-at g11)

    ; Connectivity between adjacent grid cells
    ; Horizontal connections (east/west)
    (gridsquare-connected g00 g01 east)
    (gridsquare-connected g01 g00 west)
    (gridsquare-connected g01 g02 east)
    (gridsquare-connected g02 g01 west)
    (gridsquare-connected g02 g03 east)
    (gridsquare-connected g03 g02 west)
    
    (gridsquare-connected g10 g11 east)
    (gridsquare-connected g11 g10 west)
    (gridsquare-connected g11 g12 east)
    (gridsquare-connected g12 g11 west)
    (gridsquare-connected g12 g13 east)
    (gridsquare-connected g13 g12 west)
    
    (gridsquare-connected g20 g21 east)
    (gridsquare-connected g21 g20 west)
    (gridsquare-connected g21 g22 east)
    (gridsquare-connected g22 g21 west)
    (gridsquare-connected g22 g23 east)
    (gridsquare-connected g23 g22 west)
    
    (gridsquare-connected g30 g31 east)
    (gridsquare-connected g31 g30 west)
    (gridsquare-connected g31 g32 east)
    (gridsquare-connected g32 g31 west)
    (gridsquare-connected g32 g33 east)
    (gridsquare-connected g33 g32 west)
    
    ; Vertical connections (north/south)
    (gridsquare-connected g00 g10 south)
    (gridsquare-connected g10 g00 north)
    (gridsquare-connected g10 g20 south)
    (gridsquare-connected g20 g10 north)
    (gridsquare-connected g20 g30 south)
    (gridsquare-connected g30 g20 north)
    
    (gridsquare-connected g01 g11 south)
    (gridsquare-connected g11 g01 north)
    (gridsquare-connected g11 g21 south)
    (gridsquare-connected g21 g11 north)
    (gridsquare-connected g21 g31 south)
    (gridsquare-connected g31 g21 north)
    
    (gridsquare-connected g02 g12 south)
    (gridsquare-connected g12 g02 north)
    (gridsquare-connected g12 g22 south)
    (gridsquare-connected g22 g12 north)
    (gridsquare-connected g22 g32 south)
    (gridsquare-connected g32 g22 north)
    
    (gridsquare-connected g03 g13 south)
    (gridsquare-connected g13 g03 north)
    (gridsquare-connected g13 g23 south)
    (gridsquare-connected g23 g13 north)
    (gridsquare-connected g23 g33 south)
    (gridsquare-connected g33 g23 north)

    ; Rotation rules
    ; Clockwise rotation
    (rotation-adjacent north east)
    (rotation-adjacent east south)
    (rotation-adjacent south west)
    (rotation-adjacent west north)
    ; Counter-clockwise rotation
    (rotation-adjacent east north)
    (rotation-adjacent south east)
    (rotation-adjacent west south)
    (rotation-adjacent north west)
  )

  (:goal
    (and
      (agent-at g22)
    )
  )
)

; plan
1. (moveforward g00 g01 east)
   deleted: (agent-at g00)
   added: (agent-at g01)
   goals met: 0 of 1
2. (moveforward g01 g02 east)
   deleted: (agent-at g01)
   added: (agent-at g02)
   goals met: 0 of 1
3. (moveforward g02 g03 east)
   deleted: (agent-at g02)
   added: (agent-at g03)
   goals met: 0 of 1
4. (rotate east south)
   deleted: (agent-rotated east)
   added: (agent-rotated south)
   goals met: 0 of 1
5. (moveforward g03 g13 south)
   deleted: (agent-at g03)
   added: (agent-at g13)
   goals met: 0 of 1
6. (moveforward g13 g23 south)
   deleted: (agent-at g13)
   added: (agent-at g23)
   goals met: 0 of 1
7. (rotate south west)
   deleted: (agent-rotated south)
   added: (agent-rotated west)
   goals met: 0 of 1
8. (moveforward g23 g22 west)
   deleted: (agent-at g23)
   added: (agent-at g22)
   goals met: 1 of 1
